# Energy Analysis Opening Get Window Type Method

Source: https://www.revitapidocs.com/2026/0dcc038c-7d3f-a038-a53c-e8910683b16c.htm

---

| Energy Analysis Opening Get Window Type Method |
| --- |

Gets the analytic window type this opening is associated with. Null when this opening is not a window.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public EnergyAnalysisWindowType GetWindowType()
```

```
Public Function GetWindowType As EnergyAnalysisWindowType
```

```
public:
EnergyAnalysisWindowType^ GetWindowType()
```

```
member GetWindowType : unit -> EnergyAnalysisWindowType
```

#### Return Value

EnergyAnalysisWindowType
The analytic window type. See Also

#### Reference

EnergyAnalysisOpening Class Autodesk.Revit.DB.Analysis Namespace